1130646208/STM32/6OLED/d/OLED_I2C.h
#ifndef __OLED_I2C_H
#define	__OLED_I2C_H

#include "stm32f10x_i2c.h"

#define OLED_ADDRESS	0x78 //通过调整0R电阻,屏可以0x78和0x7A两个地址 -- 默认0x3C
u32 mypow(u8 m,u8 n);
void I2C_Configuration(void);
void I2C_WriteByte(uint8_t addr,uint8_t data);
void WriteCmd(unsigned char I2C_Command);
void WriteDat(unsigned char I2C_Data);
void OLED_Init(void);
void OLED_SetPos(unsigned char x, unsigned char y);
void OLED_Fill(unsigned char fill_Data);
void OLED_CLS(void);
void OLED_ON(void);
void OLED_OFF(void);
void LED_ShowChar(u8 x,u8 y,u8 chr,u8 size);
void OLED_ShowStr(unsigned char x, unsigned char y, unsigned char ch[], unsigned char TextSize);
void OLED_ShowNum(unsigned char  x,unsigned char  y,u32 num,unsigned char len,unsigned char  size);
void OLED_ShowFnum(u8 x,u8 y,float num,u8 zlen,u8 flen,u8 size);
void OLED_ShowCN(unsigned char x, unsigned char y, unsigned char N);
void OLED_DrawBMP(unsigned char x0,unsigned char y0,unsigned char x1,unsigned char y1,unsigned char BMP[]);

#endif
